app/views/components/_post.html.erb

              <div class='col-sm-2'>
                  <center><a href="/@<%=current_user.username%>"><img src="<%= User.find(@p.user_id).avatar.url(:thumb) %>" height="50px" width="50px" style="border-radius:50%;border:2px solid #1ac9c9"></img></a></center>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

              <div class="col-sm-7">
                  <a style="color:#1ac9c9" href="/@<%= User.find(@p.user_id).username %>" class='post-title'><strong><%= User.find(@p.user_id).display_name %></strong>  &nbsp;<span style="font-size:10px">@<%= User.find(@p.user_id).username %></span></a>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 2)  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]

                      <span><a class="pray-button" href=""><span style="padding:7px;padding-left:10px;padding-right:10px;">PRAY</span><span class="action-count">3543</span></a></span>
                      <span><a class="pray-button" href="/post/<%= @p.id %>"><span style="padding:7px;padding-left:10px;padding-right:10px;"><span class="glyphicon glyphicon-comment"></span></span><span class="action-count"><%= Comment.where(post_id: @p.id).count %></span></a></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 18]]