app/views/components/_top_users.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "corear"]]
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 6]]
---
                        <div class="col-sm-5">
                       <a href="/@<%= @u.username %>" style="font-size:90%;color:#000;opacity:0.7"><%= pluralize(@u.followers.count, "follower") %></a>