app/views/comments/_form.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 18]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 18]]
---
<%= form_for([Post.find(@post), Post.find(@post).comments.build]) do |f|  %>