app/views/pages/home.html.erb


               <h1 style="color: #1ac9c9"><%= number_with_delimiter(current_user.posts.count, :delimiter => ',') %></h1><span style="opacity:0.7;font-weight:400;letter-spacing:1px;font-size:15px;color:#000;">&nbsp;POSTS</span>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC