app/views/pages/posts.html.erb

<script>
    document.title="All <%= number_with_delimiter(Post.all.count, :delimiter => ',') %> Posts | Unafire"
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts"