app/views/pages/postpage.html.erb

                <div class='col-sm-12'>
                    <% if Post.find(@post).content.match(/pray/i) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 18]]

        <div class="col-sm-2"><center>
            <a href="/@<%= User.find(Post.find(@post).user_id).username %>"><img class="profilePic" style="width:100px;height:100px" src="<%= User.find(Post.find(@post).user_id).avatar.url(:small) %>"></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

<div class="panel panel-default post-panel">
    <center><h1 style="font-weight:310; letter-spacing:2px;margin-top:10px;">COMMENTS (<%= Comment.where(post_id: @p.id).count %>)</h1></center>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 18]]