app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "aespect"]]
---
            <div class="col-xs-8">
                <center><img class="profilePic" src="<%= User.find_by_username(@username).avatar.url(:medium) %>"></center>