app/views/pages/search_handler.html.erb

SELECT "users".* FROM "users" WHERE (username LIKE '%core%')
---
                            <center>
                       <a href="/@<%= @u.username %>" style="font-size:90%;color:#000;opacity:0.7;"><%= pluralize(@u.followers.count, "follower") %></a>