app/controllers/pages_controller.rb

SELECT "users".* FROM "users" WHERE (user_id != current_user.id)
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def home
     @posts = Post.all.where('post_type != ?', "Announcement")
     @featured = Post.all.where('post_type = ?', "Announcement").where('created_at > ?', 1.week.ago).take(1)
     @newPost = Post.new
     @users = User.all.where('id != ?', current_user.id).sort_by { |u| -u.followers.count }.take(100).sample(3)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "nicompoop"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
  def profile
    if (User.find_by_username(params[:id]))
    @username = params[:id]
    else
    redirect_to root_path, :alert=> "User #{params[:id]} not found!"
    end

    @posts = Post.all.where('user_id = ?', User.find_by_username(params[:id]).id)
    @newPost = Post.new
     @users = User.all.where('id != ?', current_user.id).sort_by { |u| -u.followers.count }.take(100).sample(3)

SELECT  "users".* FROM "users" WHERE (username LIKE '%r%') LIMIT 50
SELECT  "posts".* FROM "posts" WHERE (content LIKE '%r%')  ORDER BY "posts"."created_at" DESC, created_at DESC LIMIT 50
---
  def search_handler
    @query = params[:id]
    @type = params[:id1]
    if @type == 'users'
      @users = User.where('lower(username) LIKE ?', "%#{@query.downcase}%").sort_by { |u| -u.followers.count }.take(50)
    end
    if @type == 'posts'
      @posts = Post.where('lower(content) LIKE ?', "%#{@query.downcase}%").order("created_at DESC").take(50)

SELECT "users".* FROM "users" WHERE (id != 2)
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def posts
     @users = User.all.where('id != ?', current_user.id).sort_by { |u| -u.followers.count }.take(100).sample(3)
     if params[:type] then
       @posts = Post.all.where('post_type = ?', params[:type].capitalize)
     else
       @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 18]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 18]]
---
  def postpage
    if (Post.find(params[:id]))
    @post = params[:id]
    @p = Post.find(params[:id])
    @comments = Comment.where(post_id: @post).order("created_at DESC")