app/controllers/posts_controller.rb

    def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 18]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 18]]